{
  "id": "murray_score",
  "title": "Murray Score for Acute Lung Injury",
  "description": "Stratifies severity of acute lung injury (ALI) and acute respiratory distress syndrome (ARDS), and is also used for patient selection for extracorporeal membrane oxygenation (ECMO). The Murray Score provides objective assessment of lung injury severity using four physiological parameters.",
  "category": "pulmonology",
  "version": "1988",
  "parameters": [
    {
      "name": "chest_xray_score",
      "type": "integer",
      "required": true,
      "description": "Chest X-ray score based on number of quadrants with alveolar consolidation. 0 = no consolidation, 1 = consolidation in 1 quadrant, 2 = consolidation in 2 quadrants, 3 = consolidation in 3 quadrants, 4 = consolidation in all 4 quadrants",
      "options": [0, 1, 2, 3, 4],
      "validation": {
        "min": 0,
        "max": 4,
        "enum": [0, 1, 2, 3, 4]
      },
      "unit": "quadrants"
    },
    {
      "name": "hypoxemia_score",
      "type": "integer",
      "required": true,
      "description": "Hypoxemia score based on PaO2/FiO2 ratio. 0 = PaO2/FiO2 ≥300, 1 = PaO2/FiO2 225-299, 2 = PaO2/FiO2 175-224, 3 = PaO2/FiO2 100-174, 4 = PaO2/FiO2 <100",
      "options": [0, 1, 2, 3, 4],
      "validation": {
        "min": 0,
        "max": 4,
        "enum": [0, 1, 2, 3, 4]
      },
      "unit": "score"
    },
    {
      "name": "peep_score",
      "type": "integer",
      "required": true,
      "description": "PEEP score based on positive end-expiratory pressure requirement. 0 = PEEP ≤5 cmH2O, 1 = PEEP 6-8 cmH2O, 2 = PEEP 9-11 cmH2O, 3 = PEEP 12-14 cmH2O, 4 = PEEP ≥15 cmH2O",
      "options": [0, 1, 2, 3, 4],
      "validation": {
        "min": 0,
        "max": 4,
        "enum": [0, 1, 2, 3, 4]
      },
      "unit": "score"
    },
    {
      "name": "compliance_score",
      "type": "integer",
      "required": true,
      "description": "Lung compliance score based on static compliance when available. 0 = compliance ≥80 mL/cmH2O, 1 = compliance 60-79 mL/cmH2O, 2 = compliance 40-59 mL/cmH2O, 3 = compliance 20-39 mL/cmH2O, 4 = compliance ≤19 mL/cmH2O",
      "options": [0, 1, 2, 3, 4],
      "validation": {
        "min": 0,
        "max": 4,
        "enum": [0, 1, 2, 3, 4]
      },
      "unit": "score"
    }
  ],
  "result": {
    "name": "murray_score",
    "type": "float",
    "unit": "points",
    "description": "Murray Score calculated as the average of the four component scores"
  },
  "interpretation": {
    "ranges": [
      {
        "min": 0,
        "max": 1,
        "stage": "No Lung Injury",
        "description": "No acute lung injury",
        "interpretation": "No evidence of acute lung injury. Continue standard care and monitoring. ECMO not indicated."
      },
      {
        "min": 1,
        "max": 2.5,
        "stage": "Mild to Moderate Lung Injury",
        "description": "Mild to moderate acute lung injury",
        "interpretation": "Mild to moderate acute lung injury present. Continue supportive care with lung-protective ventilation. Monitor for progression. ECMO generally not indicated unless other factors present."
      },
      {
        "min": 2.5,
        "max": 3,
        "stage": "Severe Lung Injury",
        "description": "Severe acute lung injury",
        "interpretation": "Severe acute lung injury consistent with ARDS. Implement lung-protective ventilation strategies, prone positioning, and consider advanced therapies. ECMO may be considered in select cases with refractory hypoxemia."
      },
      {
        "min": 3,
        "max": 4,
        "stage": "Very Severe Lung Injury",
        "description": "Very severe acute lung injury",
        "interpretation": "Very severe acute lung injury with poor prognosis. Maximize lung-protective strategies and consider ECMO evaluation in appropriate candidates. Ensure multidisciplinary consultation and family discussion regarding prognosis."
      }
    ]
  },
  "references": [
    "Murray JF, Matthay MA, Luce JM, Flick MR. An expanded definition of the adult respiratory distress syndrome. Am Rev Respir Dis. 1988;138(3):720-3. doi: 10.1164/ajrccm/138.3.720.",
    "Bernard GR, Artigas A, Brigham KL, Carlet J, Falke K, Hudson L, et al. The American-European Consensus Conference on ARDS. Definitions, mechanisms, relevant outcomes, and clinical trial coordination. Am J Respir Crit Care Med. 1994;149(3 Pt 1):818-24. doi: 10.1164/ajrccm.149.3.7509706.",
    "Peek GJ, Mugford M, Tiruvoipati R, Wilson A, Allen E, Thalanany MM, et al. Efficacy and economic assessment of conventional ventilatory support versus extracorporeal membrane oxygenation for severe adult respiratory failure (CESAR): a multicentre randomised controlled trial. Lancet. 2009;374(9698):1351-63. doi: 10.1016/S0140-6736(09)61069-2."
  ],
  "formula": "Murray Score = (Chest X-ray Score + Hypoxemia Score + PEEP Score + Compliance Score) / 4",
  "notes": [
    "The Murray Score was developed to provide objective assessment of acute lung injury severity",
    "Originally designed for ARDS research but now used clinically for severity assessment",
    "Score ≥3.0 has been used as one criterion for ECMO candidacy in severe ARDS",
    "Should be interpreted in conjunction with overall clinical picture and other prognostic factors",
    "Chest X-ray scoring requires systematic evaluation of all four quadrants for consolidation",
    "PaO2/FiO2 ratio should be calculated using arterial blood gas and ventilator FiO2 settings",
    "PEEP and compliance values should be obtained from mechanical ventilator measurements",
    "Score may change over time as patient condition evolves during treatment",
    "Not a standalone decision tool for ECMO but one component of comprehensive assessment"
  ]
}